In [17]:
from statsmodels.stats.outliers_influence import variance_inflation_factor

In [18]:
import pandas as pd
import numpy as np

In [19]:
#reading the dataframe
df = pd.read_csv('salary.csv')
df.head()

   Gender  Age  Years of service  Education level  Salary
0       0   27               1.7                0   39343
1       1   26               1.1                1   43205
2       1   26               1.2                0   47731
3       0   27               1.6                1   46525
4       0   26               1.5                1   40891

In [20]:
#making a vif dataframe to store the values
vif = pd.DataFrame()

In [21]:
vif

Empty DataFrame
Columns: []
Index: []

In [22]:
type(vif)

pandas.core.frame.DataFrame

In [23]:
#selecting the independent features
X = df.iloc[:,:-1]

In [24]:
#making a column variables in the dataframe vif
vif['variables'] = X.columns

In [25]:
vif

          variables
0            Gender
1               Age
2  Years of service
3   Education level

In [26]:
df.shape

(5, 5)

In [27]:
df.values

array([[0.0000e+00, 2.7000e+01, 1.7000e+00, 0.0000e+00, 3.9343e+04],
       [1.0000e+00, 2.6000e+01, 1.1000e+00, 1.0000e+00, 4.3205e+04],
       [1.0000e+00, 2.6000e+01, 1.2000e+00, 0.0000e+00, 4.7731e+04],
       [0.0000e+00, 2.7000e+01, 1.6000e+00, 1.0000e+00, 4.6525e+04],
       [0.0000e+00, 2.6000e+01, 1.5000e+00, 1.0000e+00, 4.0891e+04]])

In [28]:
X

   Gender  Age  Years of service  Education level
0       0   27               1.7                0
1       1   26               1.1                1
2       1   26               1.2                0
3       0   27               1.6                1
4       0   26               1.5                1

In [29]:
#making a column VIF in dataframe vif and then adding all the values in the column
vif['VIF']= [variance_inflation_factor(X.values,i) for i in range(X.shape[1])]

In [30]:
vif

          variables       VIF
0            Gender    462.06
1               Age  17360.28
2  Years of service  13072.05
3   Education level     49.29

- Since all the values of VIF are very large let's drop out the Age column and check the results

In [43]:
#dropping the age column
X = X.drop('Age',axis = 1)
X

   Gender  Years of service  Education level
0       0               1.7                0
1       1               1.1                1
2       1               1.2                0
3       0               1.6                1
4       0               1.5                1

In [45]:
vif

          variables       VIF
0            Gender    462.06
1               Age  17360.28
2  Years of service  13072.05
3   Education level     49.29

In [46]:
#dropping the index 1 of dataframe vif
vif = vif.drop(index=1,axis=0)
vif

          variables       VIF
0            Gender    462.06
2  Years of service  13072.05
3   Education level     49.29

In [47]:
X

   Gender  Years of service  Education level
0       0               1.7                0
1       1               1.1                1
2       1               1.2                0
3       0               1.6                1
4       0               1.5                1

In [48]:
#calculating the new vif scores
vif['VIF']= [variance_inflation_factor(X.values,i) for i in range(X.shape[1])]

In [50]:
vif

          variables       VIF
0            Gender  1.346386
2  Years of service  2.597892
3   Education level  2.320783

In [51]:
vif.reset_index(drop=True,inplace=True)

In [52]:
vif

          variables       VIF
0            Gender  1.346386
1  Years of service  2.597892
2   Education level  2.320783

- We can clearly see that dropping a single column brought down the whole vif scores below 5